
  1 <?php
  2
  3 $random = array("あ","い","う","え","お","か","き","く","け","こ","た","ち","つ","て","と","な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ","ま","み","む","め","も","や","ゆ","よ","ら","り","る","れ","ろ","わ","を
    ","ん");
  4
  5
  6 while($input = fgets(STDIN))
  7 {
  8
  9   $num = array();
 10   $max_min = array(0,40);
 11
 12   intval($input);
 13
 14   for($i=0; $i < $input; $i++)
 15   {
 16     $num[$i] = rand($max_min[0],$max_min[1]);
 17   }
 18
 19   for($j=0; $j < count($num); $j++)
 20   {
 21       echo $random[$num[$j]];
 22   }
 23
 24 }